while True:
    число1 = float(input("Введіть перше число: "))
    число2 = float(input("Введіть друге число: "))
    число3 = float(input("Введіть третє число: "))
    опція = input("Виберіть опцію (сума/добуток): ")
    сума = число1 + число2 + число3
    добуток = число1 * число2 * число3
    if опція == "сума":
        print(f"Сума трьох чисел: {сума}")
    elif опція == "добуток":
        print(f"Добуток трьох чисел: {добуток}")
    else:
        print("Невірна опція. Будь ласка, виберіть 'сума' або 'добуток'.")

    продовжити = input("Бажаєте продовжити? (так/ні): ")
    if продовжити.lower() != 'так':
        break