
while True:

    число1 = float(input("Введіть перше число: "))
    число2 = float(input("Введіть друге число: "))
    число3 = float(input("Введіть третє число: "))


    опція = input("Виберіть опцію (максимум/мінімум/середнє): ")


    максимум = max(число1, число2, число3)
    мінімум = min(число1, число2, число3)
    середнє = (число1 + число2 + число3) / 3


    if опція == "максимум":
        print(f"Максимум: {максимум}")
    elif опція == "мінімум":
        print(f"Мінімум: {мінімум}")
    elif опція == "середнє":
        print(f"Середнє: {середнє}")
    else:
        print("Невірна опція. Будь ласка, виберіть 'максимум', 'мінімум' або 'середнє'.")

    продовжити = input("Бажаєте продовжити? (так/ні): ")
    if продовжити.lower() != 'так':
        break

