while True:
    метри = float(input("Введіть кількість метрів: "))
    опція = input("Виберіть одиницю для конвертації (милі/дюйми/ярди): ")
    if опція == "милі":
        милі = метри * 0.000621371
        print(f"{метри} метрів дорівнює {милі} миль")
    elif опція == "дюйми":
        дюйми = метри * 39.3701
        print(f"{метри} метрів дорівнює {дюйми} дюймів")
    elif опція == "ярди":
        ярди = метри * 1.09361
        print(f"{метри} метрів дорівнює {ярди} ярдів")
    else:
        print("Невірна опція. Будь ласка, виберіть 'милі', 'дюйми' або 'ярди'.")
    продовжити = input("Бажаєте продовжити? (так/ні): ")
    if продовжити.lower() != 'так':
        break